---
title: PartMakerMethodForWallFailures
classe: Autodesk.Revit.DB.BuiltInFailures+PartMakerMethodForWallFailures
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 3
---

# PartMakerMethodForWallFailures

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `FailureDefinitionId CouldNotAdjustWallPartsAtJoin { get; }` | `PartMakerMethodForWallFailures.CouldNotAdjustWallPartsAtJoin` | FailureDefinitionId |
| `FailureDefinitionId CouldNotCreateWallPart { get; }` | `PartMakerMethodForWallFailures.CouldNotCreateWallPart` | FailureDefinitionId |
| `FailureDefinitionId CouldNotCreateWallPartDueToWallJoin { get; }` | `PartMakerMethodForWallFailures.CouldNotCreateWallPartDueToWallJoin` | FailureDefinitionId |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```